In [1]:
# data analysis and wrangling
import pandas as pd
import numpy as np

# visualization
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

## read_csv takes an encoding option to deal with files in different formats

In [2]:
df=pd.read_csv("Titanic.csv",encoding = "ISO-8859-1") #"utf-8"

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.Survived.unique()

array([0, 1])

### std : Standard deviation of the obersvations.

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### We can notice that Age Count is less than 891 ==> there's null values

In [6]:
df.Age.isnull().any()

True

In [7]:
df.Parch.isnull().any()

False

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

# describe

In [9]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
df.describe(include=['O'])

                                    Name   Sex  Ticket    Cabin Embarked
count                                891   891     891      204      889
unique                               891     2     681      147        3
top     Salkjelsvik, Miss. Anna Kristine  male  347082  B96 B98        S
freq                                   1   577       7        4      644

In [11]:
df[df["Name"]=="Moor, Mrs. (Beila)"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
823,824,1,3,"Moor, Mrs. (Beila)",female,27.0,0,1,392096,12.475,E121,S

# describe test

In [12]:
df_test = pd.DataFrame({'categorical': pd.Categorical(['dead','alive','sick',"jawou behi"]),
                    'numeric': [1,0,2,3],
                     'object': ['d','a', 'a', 'c'],
                  })

In [13]:
df_test

  categorical  numeric object
0        dead        1      d
1       alive        0      a
2        sick        2      a
3  jawou behi        3      c

In [14]:
df_test.describe() #only numerical

        numeric
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

### The top is the most common value. The freq is the most common valueâ€™s frequency

In [15]:
df_test.describe(include=['O'])# will limit the function to columns of type object only

       object
count       4
unique      3
top         a
freq        2

In [16]:
df_test.describe(include=['category'])

       categorical
count            4
unique           4
top           sick
freq             1

df_test.describe(include='all')

# Drop useless columns

In [17]:
df = df.drop(['Name', 'Ticket', 'Cabin'], axis=1)
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

# Drop null values

In [18]:
df = df.dropna()

# groupby

In [19]:
df.Pclass.unique()

array([3, 1, 2])

### the sum value of survivals for each Pclass

In [20]:
df[['Pclass', 'Survived']].groupby(['Pclass'], as_index=False).sum()

   Pclass  Survived
0       1       120
1       2        83
2       3        85

In [21]:
a=df[df["Pclass"]==1]
a[a["Survived"]==1].shape[0]

120

### male or female survived more?

In [22]:
df[["Sex","Survived"]].groupby(["Sex"],as_index=True).sum()

        Survived
Sex
female       195
male          93

# Evaluating columns